rang = int(input("Введіть число, щоб дізнатись в які рамки воно підпадає => "))

#Число дорівнює або менше ніж -500
if rang <= -500:
    print(f"{rang} Дорівнює або менше ніж -500")
#Дорівнює або менше ніж -100, але більше -500
elif -100 >= rang > -500:
    print(f"{rang} Дорівнює або менше ніж -100, але більше -500")
#Менше ніж 0, але більше -100
elif 0 > rang > -100:
    print(f"{rang} Менше ніж 0, але більше -100")
#Дорівнює або більше ніж 0, але менше 100
elif 100 > rang >= 0:
    print(f"{rang} Дорівнює або більше ніж 0, але менше 100")
#Дорівнює або більше ніж 100, але менше 500
elif 500 > rang >= 100:
    print(f"{rang} Дорівнює або більше ніж 100, але менше 500")
#Дорівнює або більше ніж 500
elif rang >= 500:
    print(f"{rang} Дорівнює або більше ніж 500")
else:
    print(f"{rang} Дане число не входить до жодного діапазону")




